In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import  seaborn as sns

In [118]:
data = pd.read_csv('/content/imdb_data.csv')

In [119]:
data_copy = data.copy()

In [120]:
data_copy.head()

   id  ...   revenue
0   1  ...  12314651
1   2  ...  95149435
2   3  ...  13092000
3   4  ...  16000000
4   5  ...   3923970

[5 rows x 23 columns]

In [34]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 23 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   id                     3000 non-null   int64
 1   belongs_to_collection  604 non-null    object
 2   budget                 3000 non-null   int64
 3   genres                 2993 non-null   object
 4   homepage               946 non-null    object
 5   imdb_id                3000 non-null   object
 6   original_language      3000 non-null   object
 7   original_title         3000 non-null   object
 8   overview               2992 non-null   object
 9   popularity             3000 non-null   float64
 10  poster_path            2999 non-null   object
 11  production_companies   2844 non-null   object
 12  production_countries   2945 non-null   object
 13  release_date           3000 non-null   object
 14  runtime                2998 non-null   float64
 15  spoken_languages       2980 non-null   object
 16  status                 3000 non-null   object
 17  tagline                2403 non-null   object
 18  title                  3000 non-null   object
 19  Keywords               2724 non-null   object
 20  cast                   2987 non-null   object
 21  crew                   2984 non-null   object
 22  revenue                3000 non-null   int64
dtypes: float64(2), int64(3), object(18)
memory usage: 539.2+ KB

In [35]:
data.columns

Index(['id', 'belongs_to_collection', 'budget', 'genres', 'homepage',
       'imdb_id', 'original_language', 'original_title', 'overview',
       'popularity', 'poster_path', 'production_companies',
       'production_countries', 'release_date', 'runtime', 'spoken_languages',
       'status', 'tagline', 'title', 'Keywords', 'cast', 'crew', 'revenue'],
      dtype='object')

<h1>Task to DO

## You have been hired by a rookie movie producer to help him decide what type of movies to produce and which actors to cast. You have to back your recommendations based on thorough analysis of the data he shared with you which has the list of 3000 movies and the corresponding details.

## As a data scientist, you have to first explore the data and check its sanity.

## Further, you have to answer the following questions:
1. ### <b> Which movie made the highest profit? Who were its producer and director? Identify the actors in that film.</b>
2. ### <b>This data has information about movies made in different languages. Which language has the highest average ROI (return on investment)? </b>
3. ### <b> Find out the unique genres of movies in this dataset.</b>
4. ### <b> Make a table of all the producers and directors of each movie. Find the top 3 producers who have produced movies with the highest average RoI? </b>
5. ### <b> Which actor has acted in the most number of movies? Deep dive into the movies, genres and profits corresponding to this actor. </b>
6. ### <b>Top 3 directors prefer which actors the most? </b>

In [121]:
data.columns

Index(['id', 'belongs_to_collection', 'budget', 'genres', 'homepage',
       'imdb_id', 'original_language', 'original_title', 'overview',
       'popularity', 'poster_path', 'production_companies',
       'production_countries', 'release_date', 'runtime', 'spoken_languages',
       'status', 'tagline', 'title', 'Keywords', 'cast', 'crew', 'revenue'],
      dtype='object')

In [122]:
# Based on the requirments given, all the columns are not that important
# We will only be filtering out the columns which are importatnt for our analysis.

req_col = ['id','budget','genres','original_language', 'original_title','popularity','production_companies','cast','crew', 'revenue']

In [123]:
data_copy = data_copy[req_col]

In [124]:
data_copy.head()

   id    budget  ...                                               crew   revenue
0   1  14000000  ...  [{'credit_id': '59ac067c92514107af02c8c8', 'de...  12314651
1   2  40000000  ...  [{'credit_id': '52fe43fe9251416c7502563d', 'de...  95149435
2   3   3300000  ...  [{'credit_id': '54d5356ec3a3683ba0000039', 'de...  13092000
3   4   1200000  ...  [{'credit_id': '52fe48779251416c9108d6eb', 'de...  16000000
4   5         0  ...  [{'credit_id': '52fe464b9251416c75073b43', 'de...   3923970

[5 rows x 10 columns]

In [125]:
data_copy.isna().sum()

id                        0
budget                    0
genres                    7
original_language         0
original_title            0
popularity                0
production_companies    156
cast                     13
crew                     16
revenue                   0
dtype: int64

In [126]:
def convert_to_list(s):
  return eval(s)

In [127]:
data_copy.loc[~data_copy['genres'].isna(),'genres'] = data_copy.loc[~data_copy['genres'].isna(),'genres'].apply(convert_to_list)

In [128]:
data_copy.loc[~data_copy['cast'].isna(),'cast'] = data_copy.loc[~data_copy['cast'].isna(),'cast'].apply(convert_to_list)

In [129]:
data_copy.loc[~data_copy['crew'].isna(),'crew'] = data_copy.loc[~data_copy['crew'].isna(),'crew'].apply(convert_to_list)

In [130]:
data_copy['genres'].dtype == 'object'

True

In [131]:
data_copy.describe()

                id        budget   popularity       revenue
count  3000.000000  3.000000e+03  3000.000000  3.000000e+03
mean   1500.500000  2.253133e+07     8.463274  6.672585e+07
std     866.169729  3.702609e+07    12.104000  1.375323e+08
min       1.000000  0.000000e+00     0.000001  1.000000e+00
25%     750.750000  0.000000e+00     4.018053  2.379808e+06
50%    1500.500000  8.000000e+06     7.374861  1.680707e+07
75%    2250.250000  2.900000e+07    10.890983  6.891920e+07
max    3000.000000  3.800000e+08   294.337037  1.519558e+09

1. We can see in the descriptive statistics that min(budget)=0.00, which is not possible. So wherever the data was not available the 0.00 has been fed.<br>
2. Just check, if the difference between the mean nad median(50%) of the column is big than we can conclude that the column has outliers.<br>
3. replacing the 0.00 values in budget with the median. As we can clearly see that budget has outliers, in case ofcolumn having outliers we can only replace the missing data with median.

In [ ]:
data_copy['budget'][data_copy['budget']<1000] = data_copy['budget'].median()

In [133]:
data_copy['budget'].median()

8000000.0

In [134]:
data_copy.describe()

                id        budget   popularity       revenue
count  3000.000000  3.000000e+03  3000.000000  3.000000e+03
mean   1500.500000  2.474467e+07     8.463274  6.672585e+07
std     866.169729  3.583254e+07    12.104000  1.375323e+08
min       1.000000  2.500000e+03     0.000001  1.000000e+00
25%     750.750000  8.000000e+06     4.018053  2.379808e+06
50%    1500.500000  8.000000e+06     7.374861  1.680707e+07
75%    2250.250000  2.900000e+07    10.890983  6.891920e+07
max    3000.000000  3.800000e+08   294.337037  1.519558e+09

1. ### <b> Which movie made the highest profit? Who were its producer and director? Identify the actors in that film.</b>

In [135]:
data_copy['profit'] = data_copy['revenue'] - data_copy['budget']
data_copy['roi'] = data_copy['profit'] * 100 / data_copy['budget']

In [136]:
data_copy.head(3)

   id    budget  ...    profit         roi
0   1  14000000  ...  -1685349  -12.038207
1   2  40000000  ...  55149435  137.873588
2   3   3300000  ...   9792000  296.727273

[3 rows x 12 columns]

In [137]:
max_profit_indx = data_copy['profit'].idxmax()

In [138]:
data_copy.dropna(inplace=True)

In [139]:
data_copy.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2829 entries, 0 to 2999
Data columns (total 12 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   id                    2829 non-null   int64
 1   budget                2829 non-null   int64
 2   genres                2829 non-null   object
 3   original_language     2829 non-null   object
 4   original_title        2829 non-null   object
 5   popularity            2829 non-null   float64
 6   production_companies  2829 non-null   object
 7   cast                  2829 non-null   object
 8   crew                  2829 non-null   object
 9   revenue               2829 non-null   int64
 10  profit                2829 non-null   int64
 11  roi                   2829 non-null   float64
dtypes: float64(2), int64(4), object(6)
memory usage: 287.3+ KB

In [140]:
producers = []
Directors = []
for i,crew in enumerate(data_copy['crew'].values):
  for ele in crew:
    #print(type(ele))
    if ele['job'] == 'Producer':
      producers.append((i,ele['name']))
    if ele['job'] == 'Director':
      Directors.append((i,ele['name']))
    else:
      pass

In [141]:
producers[0:5]

[(0, 'Andrew Panay'),
 (1, 'Whitney Houston'),
 (1, 'Mario Iscovich'),
 (1, 'Debra Martin Chase'),
 (2, 'David Lancaster')]

In [142]:
actors = []
for i,cast in enumerate(data_copy['cast'].values):
  for ele in cast:
    actors.append((i,ele['name']))

actors[0:5]

[(0, 'Rob Corddry'),
 (0, 'Craig Robinson'),
 (0, 'Clark Duke'),
 (0, 'Adam Scott'),
 (0, 'Chevy Chase')]

In [143]:
max_profit_indx = data_copy['profit'].idxmax()

In [144]:
print('Highest grossing movie :',data_copy['original_title'].loc[max_profit_indx])

Highest grossing movie : Furious 7

In [145]:
producer = []
for prod in producers:
  if prod[0] == max_profit_indx:
    producer.append(prod[1])
print('The list of producers for the film are : ', producer)

The list of producers for the film are :  ['Paula Weinstein', 'Allison Abbate', 'Joel Simon', 'Bernie Goldmann', 'Christopher DeFaria']

In [146]:
actor = []
for prod in actors:
  if prod[0] == max_profit_indx:
    actor.append(prod[1])
print('The list of producers for the film are : ', actor)

The list of producers for the film are :  ['Brendan Fraser', 'Jenna Elfman', 'Steve Martin', 'Timothy Dalton', 'Heather Locklear', 'Joan Cusack', 'Marc Lawrence', 'Robert Picardo', 'Ron Perlman', 'Bill Goldberg', 'Don Stanton', 'Dan Stanton', 'Dick Miller', 'Roger Corman', 'Kevin McCarthy', 'Matthew Lillard', 'Mary Woronov', 'Bill McKinney', 'George Murdock', 'Vernon Wells', 'Leo Rossi', 'Archie Hahn', 'Allan Graf', 'Joe Alaskey', 'Jeff Bennett', 'Billy West', 'Eric Goldberg', 'Casey Kasem', 'Frank Welker', 'Austyn Cuccia', 'Marie-Claude Jacques', 'Michael Azria', 'Dan Romanelli', "Ryan O'Dell", 'Tara Wilson', 'Tanee McCall', 'Gelsey Weiss', 'Brenda Mae Hamilton', 'Liz Ramos', 'Emily Rose Zachary', 'Becca Sweitzer', 'Janina Garraway', 'Alysha Wheeler', 'Micki Duran', 'Chi Johnson', 'Chi Johnson', 'Shealan Spencer', 'Shanti Lowry', 'Brandon Henschel', 'Erica Gudis', 'John Munro Cameron', 'Peter Graves', 'Glen Hambly', 'Louis Kiss', 'Nikki Martin', 'Laura Orrico', 'Robert Parigi', 'Dean Ricca']

2. ### <b>This data has information about movies made in different languages. Which language has the highest average ROI (return on investment)? </b>

In [147]:
max_roi_indx = data_copy['roi'].idxmax()

In [150]:

print('The language in which the highes ROI movie made is  : ', data_copy['original_language'].iloc[max_roi_indx])

The language in which the highes ROI movie made is  :  en

3. ### <b> Find out the unique genres of movies in this dataset.</b>

In [158]:
genres = set([i[0]['name'] for i in data_copy['genres'].values])
print('The Unique Genres of movies in the dataset are : ','\n', genres)

The Unique Genres of movies in the dataset are :
 {'Crime', 'Family', 'Romance', 'Drama', 'Horror', 'War', 'Action', 'Fantasy', 'Western', 'Music', 'Comedy', 'History', 'Thriller', 'Animation', 'TV Movie', 'Mystery', 'Science Fiction', 'Foreign', 'Documentary', 'Adventure'}

4. ### <b> Make a table of all the producers and directors of each movie. Find the top 3 producers who have produced movies with the highest average RoI? </b>

In [172]:
pr = []
m = []
r = []
for i, mov in enumerate(data_copy['crew'].values):
  for ele in mov:
    if ele['job'] == 'Producer':
      pr.append(ele['name'])
      m.append(data_copy['original_title'].iloc[i])
      r.append(data_copy['roi'].iloc[i])


assert (len(pr)==len(m)) and (len(m)==len(r)) , 'Some error occured!'

In [195]:
new_df = pd.DataFrame({'Movies':m , 'Producers' : pr , 'ROI' : r})
new_df

                                        Movies  ...         ROI
0                       Hot Tub Time Machine 2  ...  -12.038207
1     The Princess Diaries 2: Royal Engagement  ...  137.873588
2     The Princess Diaries 2: Royal Engagement  ...  137.873588
3     The Princess Diaries 2: Royal Engagement  ...  137.873588
4                                     Whiplash  ...  296.727273
...                                        ...  ...         ...
5924                                 Abduction  ...  134.534729
5925                                 Abduction  ...  134.534729
5926                                 Abduction  ...  134.534729
5927                                 Abduction  ...  134.534729
5928                                 Abduction  ...  134.534729

[5929 rows x 3 columns]

In [197]:
new_grouped_df = pd.DataFrame(new_df.groupby('Producers')['ROI'].mean()).sort_values('ROI', ascending=False).head(3)
new_grouped_df

                      ROI
Producers
Amir Zbeda   1.288939e+06
Robin Cowie  4.132333e+05
Gregg Hale   4.132333e+05

In [191]:
new_grouped_df

Empty DataFrame
Columns: [Producers, Total mean ROI]
Index: []

5. ### <b> Which actor has acted in the most number of movies? Deep dive into the movies, genres and profits corresponding to this actor. </b>
6. ### <b>Top 3 directors prefer which actors the most? </b>

In [200]:
ac = []
m = []
prof = []
gen = []
for i, mov in enumerate(data_copy['cast'].values):
  for ele in mov:
    ac.append(ele['name'])
    gen.append(data_copy['genres'].iloc[i][0]['name'])
    prof.append(data_copy['profit'].iloc[i])
    m.append(data_copy['original_title'].iloc[i])


assert (len(prof)==len(m)) and (len(m)==len(ac)) and (len(ac)==len(gen)) , 'Some error occured!'

In [202]:
new_df_actor = pd.DataFrame({'Movies':m , 'genres': gen, 'Actors' : ac , 'profit' : prof})
new_df_actor

                       Movies    genres                   Actors    profit
0      Hot Tub Time Machine 2    Comedy              Rob Corddry  -1685349
1      Hot Tub Time Machine 2    Comedy           Craig Robinson  -1685349
2      Hot Tub Time Machine 2    Comedy               Clark Duke  -1685349
3      Hot Tub Time Machine 2    Comedy               Adam Scott  -1685349
4      Hot Tub Time Machine 2    Comedy              Chevy Chase  -1685349
...                       ...       ...                      ...       ...
60454               Abduction  Thriller               Jack Erdie  47087155
60455               Abduction  Thriller              Steve Blass  47087155
60456               Abduction  Thriller            Derek Burnell  47087155
60457               Abduction  Thriller  Tiffany Sander McKenzie  47087155
60458               Abduction  Thriller         Joanna Theobalds  47087155

[60459 rows x 4 columns]

In [207]:
print('The actor who acted in most movies : ',new_df_actor['Actors'].value_counts().idxmax())
print('Maximum number of movies acted by the actor who acted in most movies : ',new_df_actor['Actors'].value_counts().max())

The actor who acted in most movies :  Samuel L. Jackson
Maximum number of movies acted by the actor who acted in most movies :  30

In [211]:
profit_by_most_acted_actor = new_df_actor['profit'][new_df_actor['Actors']=='Samuel L. Jackson'].sum()
print('Average profits earned by the movies of the most acted actor : ', profit_by_most_acted_actor/30)

Average profits earned by the movies of the most acted actor :  225176722.33333334

In [214]:
sub_df = new_df_actor[['Movies','profit']][new_df_actor['Actors']=='Samuel L. Jackson']

In [221]:
print('Most profitable movie : ',sub_df['Movies'].loc[sub_df['profit'].idxmax()])

Most profitable movie :  The Avengers

In [223]:
print('Most profit on a single movie : ',sub_df['profit'].max())

Most profit on a single movie :  1299557910

In [ ]:
ac = []
m = []
prof = []
gen = []
for i, mov in enumerate(data_copy['cast'].values):
  for ele in mov:
    ac.append(ele['name'])
    gen.append(data_copy['genres'].iloc[i][0]['name'])
    prof.append(data_copy['profit'].iloc[i])
    m.append(data_copy['original_title'].iloc[i])


assert (len(prof)==len(m)) and (len(m)==len(ac)) and (len(ac)==len(gen)) , 'Some error occured!'